app/Controllers/Karyawan.php

    public function index()
    {

        $karyawanModel = new KaryawanModel();

        $data = [
            'karyawan' => $karyawanModel->select('karyawan.nama, karyawan.id, karyawan.jenis_kelamin, karyawan.nip, GROUP_CONCAT(makanan.nama_makanan SEPARATOR ", ") as makanan_favorit, GROUP_CONCAT(olahraga.nama_olahraga SEPARATOR ", ") as olahraga_favorit')
                ->join('makanan_favorit', 'makanan_favorit.karyawan_id = karyawan.id', 'left')
                ->join('olahraga_favorit', 'olahraga_favorit.karyawan_id = karyawan.id', 'left')
                ->join('makanan', 'makanan.id = makanan_favorit.makanan_id', 'left')
                ->join('olahraga', 'olahraga.id = olahraga_favorit.olahraga_id', 'left')
                ->groupBy('karyawan.id')
                ->findAll()
        ];
---
SELECT `karyawan`.`nama`, `karyawan`.`id`, `karyawan`.`jenis_kelamin`, `karyawan`.`nip`, GROUP_CONCAT(makanan.nama_makanan SEPARATOR ", ") as makanan_favorit, GROUP_CONCAT(olahraga.nama_olahraga SEPARATOR ", ") as olahraga_favorit
FROM `karyawan`
LEFT JOIN `makanan_favorit` ON `makanan_favorit`.`karyawan_id` = `karyawan`.`id`
LEFT JOIN `olahraga_favorit` ON `olahraga_favorit`.`karyawan_id` = `karyawan`.`id`
LEFT JOIN `makanan` ON `makanan`.`id` = `makanan_favorit`.`makanan_id`
LEFT JOIN `olahraga` ON `olahraga`.`id` = `olahraga_favorit`.`olahraga_id`
GROUP BY `karyawan`.`id`

    public function create()
    {
        $MakananModel = new MakananModel();
        $olahragaModel = new OlahragaModel();

        $data = [
            'makanans' => $MakananModel->findAll(),
            'olahragas' => $olahragaModel->findAll(),
        ];
---
SELECT *
FROM `makanan`
SELECT *
FROM `olahraga`

                    'nomor_telepon'   => $this->request->getPost('nomor_telepon'),
                    'alamat'   => $this->request->getPost('alamat'),
                ];
                $karyawanId = $karyawanModel->insert($karyawanData);
---
INSERT INTO `karyawan` (`nama`, `nip`, `jenis_kelamin`, `tanggal_lahir`, `nomor_telepon`, `alamat`) VALUES ('Zia', '893478', 'Perempuan', '2007-05-24', '081762553', 'Depok')

                                'makanan_id' => $makananId,
                                'karyawan_id' => $karyawanId,
                            ];
                            $MakananFavoritModel->insert($makananData);
---
INSERT INTO `makanan_favorit` (`makanan_id`, `karyawan_id`) VALUES ('2', 11)

                                'olahraga_id' => $olahragaId,
                                'karyawan_id' => $karyawanId,
                            ];
                            $olahragaFavoritModel->insert($olahragaData);
---
INSERT INTO `olahraga_favorit` (`olahraga_id`, `karyawan_id`) VALUES ('9', 11)