app/Controllers/Olahraga.php

SELECT *
FROM `olahraga`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `olahraga`
---
    public function index(): string
    {
        $OlahragaModel = new OlahragaModel();

        $pager = \Config\Services::pager();

        $data = [
            'olahragas' => $OlahragaModel->paginate(5, 'olahraga'),
            'pager' => $OlahragaModel->pager
        ];